Revit 2025 API
Zone.GrossVolume Property
Get the Gross Volume of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double GrossVolume { get; }
Public ReadOnly Property GrossVolume As Double
	Get
public:
property double GrossVolume {
	double get ();
}
member GrossVolume : float with get
Property Value
Double
Remarks
This property is used to get the Gross Volume of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace